Revit 2026 API

# RebarConstraintCreateConstraintToSurface Method

---

This method creates a constraint of 'To Surface' type for a given RebarConstrainedHandle.

The RebarConstrainedHandle should belong to a shape driven rebar, otherwise it will throw exception.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarConstraint CreateConstraintToSurface(
	RebarConstrainedHandle handle,
	Surface surface
)
```
```vb
Public Shared Function CreateConstraintToSurface (
	handle As RebarConstrainedHandle,
	surface As Surface
) As RebarConstraint
```
```cpp
public:
static RebarConstraint^ CreateConstraintToSurface(
	RebarConstrainedHandle^ handle,
	Surface^ surface
)
```
```fsharp
static member CreateConstraintToSurface :
        handle : RebarConstrainedHandle *
        surface : Surface -> RebarConstraint
```

#### Parameters

handle RebarConstrainedHandle
     The handle of the rebar that will be constrained.
surface Surface
     The surface that will be used by the constraint.

#### Return Value

RebarConstraint Returns the newly created RebarConstraint.

| Exception | Condition |
| --- | --- |
| ArgumentException | handle is no longer valid. -or- Constrained rebar isn't a shape driven rebar element. -or- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace